# PANDAS

__Pandas__ is a powerful _open-source_ data manipulation and analysis library for _Python_. 

It provides data structures and functions for efficiently __handling and analyzing structured data__, such as tables or spreadsheets.

With __pandas__, you can easily _load_, _manipulate_, _analyze data_, perform _data cleaning_ and _preprocessing_ tasks, and create _visualizations_.

It is widely used in _data science_, _machine learning_, and _data analysis_ projects.

To import the pandas library and assigns it the alias 'pd', you could make `import pandas as pd`.

## The Series Data Structure

A __pandas Series__ is a _one-dimensional labeled array_ capable of holding any data type. It is similar to a _column_ in a spreadsheet or a SQL table, or a _dictionary-like_ object. It is a fundamental _data structure_ in __pandas__ library, which is widely used for data manipulation and analysis in Python.

A __pandas Series__ consists of two main components: the _data_ and the _index_. The _data_ can be of any type, such as integers, floats, strings, or even complex objects. The _index_ is a sequence of labels that uniquely identifies each element in the Series.

Some key features of pandas Series include:
- Vectorized operations: Series supports vectorized operations, allowing you to perform element-wise computations efficiently.
- Label-based indexing: You can access elements in a Series using labels instead of integer-based indexing.
- Alignment: Series automatically aligns data based on the index, making it easy to perform operations on multiple Series with different indexes.

To create a __Series__, you can pass a list, array, or dictionary-like object to the `pd.Series()` constructor. You can also specify custom index labels if needed.

In [1]:
import pandas as pd

# Create a Series object from a list of strings
list_elements = ['a', 'b', 'c', 'd', 'e']
serie_1 = pd.Series(list_elements)
print("Serie 1:", type(serie_1), "\n", serie_1)

# Create a Series object from a list of numbers
list_numbers = [1, 2, 3, 4, 5]
serie_2 = pd.Series(list_numbers)
print("Serie 2:", type(serie_2), "\n", serie_2)

# Create a Series object from a list of numbers with a None value
list_numbers_with_none = [1, 2, None, 4, 5]
serie_3 = pd.Series(list_numbers_with_none)
print("Serie 3:", type(serie_3), "\n", serie_3)

Serie 1: <class 'pandas.core.series.Series'>
 0    a
1    b
2    c
3    d
4    e
dtype: object
Serie 2: <class 'pandas.core.series.Series'>
 0    1
1    2
2    3
3    4
4    5
dtype: int64
Serie 3: <class 'pandas.core.series.Series'>
 0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [2]:
# Create a Series object from a dictionary
dict_data = {'a': 1, 'b':2, 'c': 3, 'd': 4}
serie_4 = pd.Series(dict_data)
print("Serie 4:", type(serie_4), "\n", serie_4)

# Get the values of the Series index
print("Serie 4 index:", serie_4.index)

Serie 4: <class 'pandas.core.series.Series'>
 a    1
b    2
c    3
d    4
dtype: int64
Serie 4 index: Index(['a', 'b', 'c', 'd'], dtype='object')

In [3]:
# Create a series object from a list of tuple pairs
list_tuples = [('est-1', 'Ana'), ('est-2', 'Bob'), ('est-3', 'Claire')]
serie_5 = pd.Series(list_tuples)
print("Serie 5:", type(serie_5), "\n", serie_5)

Serie 5: <class 'pandas.core.series.Series'>
 0       (est-1, Ana)
1       (est-2, Bob)
2    (est-3, Claire)
dtype: object

In [4]:
# Create a series object from a list as values and a list as index
list_index = ['a', 'b', 'c', 'd']
list_values = ['Ana', 'Bob', 'Claire', 'Dennis']
serie_6 = pd.Series(list_values, index=list_index)
print("Serie 6:", type(serie_6), "\n", serie_6)

Serie 6: <class 'pandas.core.series.Series'>
 a       Ana
b       Bob
c    Claire
d    Dennis
dtype: object

In [5]:
# Query a Series object by boolean indexing
print("Serie 4 > 2:\n", serie_4[serie_4 > 2])
print('-'*10)
print(serie_4 > 2)

Serie 4 > 2:
 c    3
d    4
dtype: int64
----------
a    False
b    False
c     True
d     True
dtype: bool

In [6]:
# Query a Series object by fancy indexing
index_list = ['a', 'c']
print("Serie6[['a', 'c']]:\n", serie_6[index_list])

Serie6[['a', 'c']]:
 a       Ana
c    Claire
dtype: object

In [7]:
# Query a Series object using loc[]
print("Serie6.loc[['a', 'd']]:\n", serie_6.loc[['a', 'd']])

Serie6.loc[['a', 'd']]:
 a       Ana
d    Dennis
dtype: object

In [8]:
# Query a Series object using iloc[]
print("Serie6.iloc[:2]:\n", serie_6.iloc[:2])

Serie6.iloc[:2]:
 a    Ana
b    Bob
dtype: object

## The DataFrame Data Structure

A __pandas DataFrame__ is a _two-dimensional_, _labeled_ data structure in _Python_ that is commonly used for _data manipulation and analysis_. It consists of _rows_ and _columns_, similar to a table in a relational database.

The __DataFrame__ can store _heterogeneous data types_ and provides various operations and functions to perform data manipulation, filtering, grouping, and statistical analysis.

To access and manipulate the data in the __DataFrame__, you can use various _methods_ and _attributes_ provided by the __pandas__ library.

For more information on __pandas DataFrame__, refer to the [official pandas documentation](https://pandas.pydata.org/docs/reference/frame.html).

In [9]:
# create dataframes from lists
list_example = [[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]
df = pd.DataFrame(list_example)
print("Dataframe:\n", df)
print("Dataframe.shape:", df.shape)
print("Dataframe.colums:", df.columns)
print("Dataframe index:", df.index)
df.head()

Dataframe:
     0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
Dataframe.shape: (4, 3)
Dataframe.colums: RangeIndex(start=0, stop=3, step=1)
Dataframe index: RangeIndex(start=0, stop=4, step=1)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [10]:
# create a dataframe from a list of dictionaries
list_dict = [{'a': 1, 'b': 2, 'c':3}, {'d': 4, 'b': 5, 'c': 6}]
df = pd.DataFrame(list_dict)
print("Columns:", df.columns)
df.head()

Columns: Index(['a', 'b', 'c', 'd'], dtype='object')

     a  b  c    d
0  1.0  2  3  NaN
1  NaN  5  6  4.0

In [11]:
# create a dataframe from a csv file
csv_df = pd.read_csv('csv-files/StudentsInfo.csv')
print(csv_df.shape)
csv_df.head()

(30, 4)

,Name,Company,Position,Salary
0,Alice Johnson,"Hernandez, Griffith and Nelson",Petroleum engineer,4740
1,David Jones,Gomez-Garcia,"Geologist, engineering",73329
2,Eva Brown,Blevins LLC,Microbiologist,83245
3,Frank Davis,Greene-Wilson,Museum education officer,74390
4,Jack Anderson,Butler PLC,"Scientist, research (maths)",69851

In [12]:
# create a dataframe from a json file
json_df = pd.read_json('json-files/StudentsInfo.json')
print(json_df.shape)
json_df.head()

(50, 4)

   id            name                  career                college
0   1   Alice Johnson        Computer Science        Tech University
1   2       Bob Smith  Mechanical Engineering  Engineering Institute
2   3  Carol Williams  Electrical Engineering        Tech University
3   4     David Jones                 Biology        Science College
4   5       Eva Brown                 Physics        Tech University

In [13]:
# describe a dataframe
print("DF CSV:\n", csv_df.describe())
print("*"*20)
print("DF JSON:\n", json_df.describe())

DF CSV:
              Salary
count     30.000000
mean   53491.600000
std    27432.862783
min     4740.000000
25%    27472.000000
50%    64104.000000
75%    72981.250000
max    93995.000000
********************
DF JSON:
              id
count  50.00000
mean   25.50000
std    14.57738
min     1.00000
25%    13.25000
50%    25.50000
75%    37.75000
max    50.00000

In [14]:
# get information about a dataframe
print("DF CSV:\n", csv_df.info())
print("*"*20)
print("DF JSON:\n", json_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      30 non-null     object
 1   Company   30 non-null     object
 2   Position  30 non-null     object
 3   Salary    30 non-null     int64
dtypes: int64(1), object(3)
memory usage: 1.1+ KB
DF CSV:
 None
********************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       50 non-null     int64
 1   name     50 non-null     object
 2   career   50 non-null     object
 3   college  50 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.7+ KB
DF JSON:
 None

In [15]:
# indexes and columns
json_changed_df = json_df.set_index('name')
json_changed_df.head()

                id                  career                college
name
Alice Johnson    1        Computer Science        Tech University
Bob Smith        2  Mechanical Engineering  Engineering Institute
Carol Williams   3  Electrical Engineering        Tech University
David Jones      4                 Biology        Science College
Eva Brown        5                 Physics        Tech University

In [16]:
# change column name
csv_df = csv_df.rename(columns={'Salary': 'Salary (UD/year)', 'Position': 'Current Position'})
csv_df.head()

,Name,Company,Current Position,Salary (UD/year)
0,Alice Johnson,"Hernandez, Griffith and Nelson",Petroleum engineer,4740
1,David Jones,Gomez-Garcia,"Geologist, engineering",73329
2,Eva Brown,Blevins LLC,Microbiologist,83245
3,Frank Davis,Greene-Wilson,Museum education officer,74390
4,Jack Anderson,Butler PLC,"Scientist, research (maths)",69851

### Using Datetime into Pandas

In [17]:
# converting a column to datetime with to_datetime()
list_dates = ['2023-02-05', '2024-05-23']
df = pd.DataFrame(list_dates, columns=['date_example'])
print(df.info())
df['date_example'] = pd.to_datetime(df['date_example'])
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date_example  2 non-null      object
dtypes: object(1)
memory usage: 148.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date_example  2 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 148.0 bytes
None

In [18]:
sales_df = pd.read_json('json-files/sales_data.json')
sales_df = sales_df.set_index('code')
sales_df['date'] = sales_df['date'].replace('2008-Dic-23', '2008-Dec-23')
sales_df['full_date'] = sales_df['date'] + ' ' + sales_df['hour']
sales_df['full_date'] = pd.to_datetime(sales_df['full_date'], format='mixed')
print(sales_df.info())
sales_df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Sale-1117-HdZH to Sale-2882-umoM
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   client       1000 non-null   object
 1   total_price  1000 non-null   float64
 2   date         1000 non-null   object
 3   hour         1000 non-null   object
 4   credit_card  1000 non-null   int64
 5   full_date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 54.7+ KB
None

,client,total_price,date,hour,credit_card,full_date
code,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-06-03 08:13:18
Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-08-22 02:57:20
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-05-22 02:10:06
Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-12-24 21:28:34
Sale-8141-KGOb,Kenneth Marsh,498.43,1974-03-14,03:55:36,2239583806605394,1974-03-14 03:55:36

In [19]:
# converting a column from datetime to string with strftime()
sales_df['full_date_formated'] = sales_df['full_date'].dt.strftime("%Y-%b-%d %H:%M:%S")
sales_df.head()

,client,total_price,date,hour,credit_card,full_date,full_date_formated
code,,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-06-03 08:13:18,2024-Jun-03 08:13:18
Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-08-22 02:57:20,2014-Aug-22 02:57:20
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-05-22 02:10:06,1979-May-22 02:10:06
Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-12-24 21:28:34,1973-Dec-24 21:28:34
Sale-8141-KGOb,Kenneth Marsh,498.43,1974-03-14,03:55:36,2239583806605394,1974-03-14 03:55:36,1974-Mar-14 03:55:36

In [20]:
# converting a column from datetime to a timestamp with timestamp()
sales_df['timestamp'] = sales_df['full_date'].apply(lambda x: x.timestamp())
sales_df['timestamp'] = sales_df['timestamp'].astype('int64')
sales_df.head()

,client,total_price,date,hour,credit_card,full_date,full_date_formated,timestamp
code,,,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-06-03 08:13:18,2024-Jun-03 08:13:18,1717402398
Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-08-22 02:57:20,2014-Aug-22 02:57:20,1408676240
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-05-22 02:10:06,1979-May-22 02:10:06,296187006
Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-12-24 21:28:34,1973-Dec-24 21:28:34,125616514
Sale-8141-KGOb,Kenneth Marsh,498.43,1974-03-14,03:55:36,2239583806605394,1974-03-14 03:55:36,1974-Mar-14 03:55:36,132465336

In [21]:
sales_df.describe()

       total_price   credit_card                      full_date     timestamp
count  1000.000000  1.000000e+03                           1000  1.000000e+03
mean    489.713800  3.550223e+17  1996-04-08 18:37:02.880999936  8.289886e+08
min      11.850000  6.044392e+10            1970-01-09 21:20:40  7.680400e+05
25%     226.677500  1.800112e+14     1982-09-14 20:13:30.750000  4.008824e+08
50%     486.430000  3.520377e+15     1995-11-17 17:16:20.500000  8.166286e+08
75%     732.752500  4.632459e+15  2009-05-24 22:14:57.249999872  1.243203e+09
max     999.710000  4.997675e+18            2024-06-03 08:13:18  1.717402e+09
std     288.791957  1.215563e+18                            NaN  4.951866e+08

In [22]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Sale-1117-HdZH to Sale-2882-umoM
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   client              1000 non-null   object
 1   total_price         1000 non-null   float64
 2   date                1000 non-null   object
 3   hour                1000 non-null   object
 4   credit_card         1000 non-null   int64
 5   full_date           1000 non-null   datetime64[ns]
 6   full_date_formated  1000 non-null   object
 7   timestamp           1000 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 70.3+ KB

In [23]:
%%timeit -n 10
import numpy as np
print(np.sum(sales_df['total_price']))

489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
489713.80000000005
138 s  55.8 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [24]:
%%timeit -n 10
total = 0
for price in sales_df['total_price']:
    total += price
print(total)

489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
489713.79999999964
177 s  42.7 s per loop (mean  std. dev. of 7 runs, 10 loops each)

### Queries and Transformations

In [25]:
# drop a column
sales_df = sales_df.drop(columns=['full_date', 'timestamp'], axis=1)
sales_df.head()

,client,total_price,date,hour,credit_card,full_date_formated
code,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18
Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-Aug-22 02:57:20
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-May-22 02:10:06
Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-Dec-24 21:28:34
Sale-8141-KGOb,Kenneth Marsh,498.43,1974-03-14,03:55:36,2239583806605394,1974-Mar-14 03:55:36

In [26]:
# drop a row
sales_df = sales_df.drop(index='Sale-8141-KGOb')
sales_df.head()

,client,total_price,date,hour,credit_card,full_date_formated
code,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18
Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-Aug-22 02:57:20
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-May-22 02:10:06
Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-Dec-24 21:28:34
Sale-7567-cCLb,William Smith,857.13,2016-07-04,18:26:22,3541411469135312,2016-Jul-04 18:26:22

In [27]:
# query a dataframe by column
sales_df.head()

,client,total_price,date,hour,credit_card,full_date_formated
code,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18
Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-Aug-22 02:57:20
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-May-22 02:10:06
Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-Dec-24 21:28:34
Sale-7567-cCLb,William Smith,857.13,2016-07-04,18:26:22,3541411469135312,2016-Jul-04 18:26:22

In [28]:
# query a dataframe to project a column
clients = sales_df['client']
print(type(clients))
clients.head()

<class 'pandas.core.series.Series'>

code
Sale-1117-HdZH          Gary Meza
Sale-5078-hqkc       Carol Martin
Sale-8209-xGVn     Jeremy Spencer
Sale-9093-bfcp    Pamela Anderson
Sale-7567-cCLb      William Smith
Name: client, dtype: object

In [29]:
# fancy query in a dataframe
sales_df[(sales_df['total_price'] > 733.1) & (sales_df['date'] > '2023-12-31')]

,client,total_price,date,hour,credit_card,full_date_formated
code,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18
Sale-0614-sxLF,Don Hoffman,962.64,2024-01-03,23:55:55,5479577821251756,2024-Jan-03 23:55:55
Sale-2906-BTeQ,Erin Hodge,998.86,2024-01-08,06:56:38,4567559715138618,2024-Jan-08 06:56:38
Sale-1627-BccC,Walter Jimenez,912.70,2024-02-25,11:16:18,6540696554624030,2024-Feb-25 11:16:18
Sale-6265-XNWg,Douglas Valencia,927.28,2024-05-11,11:36:54,30569642128340,2024-May-11 11:36:54
Sale-2093-FIOe,Kenneth Anderson,767.85,2024-01-15,12:02:58,342591867309051,2024-Jan-15 12:02:58
Sale-3056-LhkB,Lorraine Cline,909.90,2024-04-25,00:18:15,502076502454,2024-Apr-25 00:18:15

In [30]:
# query a dataframe by row with loc
sales_df.loc['Sale-9093-bfcp', ['client', 'total_price', 'full_date_formated']]

client                     Pamela Anderson
total_price                         166.57
full_date_formated    1973-Dec-24 21:28:34
Name: Sale-9093-bfcp, dtype: object

In [31]:
# query a dataframe by row with iloc
sales_df['full_date'] = pd.to_datetime(sales_df['full_date_formated'])
sales_date_ordered_df = sales_df.sort_values(by='full_date', ascending=False)
sales_date_ordered_df.iloc[:3]

,client,total_price,date,hour,credit_card,full_date_formated,full_date
code,,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18,2024-06-03 08:13:18
Sale-6265-XNWg,Douglas Valencia,927.28,2024-05-11,11:36:54,30569642128340,2024-May-11 11:36:54,2024-05-11 11:36:54
Sale-3056-LhkB,Lorraine Cline,909.90,2024-04-25,00:18:15,502076502454,2024-Apr-25 00:18:15,2024-04-25 00:18:15

In [32]:
# query a dataframe using a boolean mask
sales_df[sales_df['total_price'] > 800].head()

,client,total_price,date,hour,credit_card,full_date_formated,full_date
code,,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18,2024-06-03 08:13:18
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-May-22 02:10:06,1979-05-22 02:10:06
Sale-7567-cCLb,William Smith,857.13,2016-07-04,18:26:22,3541411469135312,2016-Jul-04 18:26:22,2016-07-04 18:26:22
Sale-1256-GSGV,Travis Reid,913.50,1987-01-01,12:19:45,30435866051594,1987-Jan-01 12:19:45,1987-01-01 12:19:45
Sale-1938-dqto,Christopher Green DDS,994.77,2023-09-19,12:54:28,4569498359626448,2023-Sep-19 12:54:28,2023-09-19 12:54:28

In [33]:
# query a dataframe using query()
sales_df.query('total_price > 800').head()

,client,total_price,date,hour,credit_card,full_date_formated,full_date
code,,,,,,,
Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18,2024-06-03 08:13:18
Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-May-22 02:10:06,1979-05-22 02:10:06
Sale-7567-cCLb,William Smith,857.13,2016-07-04,18:26:22,3541411469135312,2016-Jul-04 18:26:22,2016-07-04 18:26:22
Sale-1256-GSGV,Travis Reid,913.50,1987-01-01,12:19:45,30435866051594,1987-Jan-01 12:19:45,1987-01-01 12:19:45
Sale-1938-dqto,Christopher Green DDS,994.77,2023-09-19,12:54:28,4569498359626448,2023-Sep-19 12:54:28,2023-09-19 12:54:28

In [34]:
# change all columns names to Capital case
sales_df.columns = sales_df.columns.str.upper()
sales_df = sales_df.reset_index()
sales_df.head()

,code,CLIENT,TOTAL_PRICE,DATE,HOUR,CREDIT_CARD,FULL_DATE_FORMATED,FULL_DATE
0,Sale-1117-HdZH,Gary Meza,832.48,2024-06-03,08:13:18,6011811575065598,2024-Jun-03 08:13:18,2024-06-03 08:13:18
1,Sale-5078-hqkc,Carol Martin,156.29,2014-08-22,02:57:20,6536303182814044,2014-Aug-22 02:57:20,2014-08-22 02:57:20
2,Sale-8209-xGVn,Jeremy Spencer,832.05,1979-05-22,02:10:06,213185615148626,1979-May-22 02:10:06,1979-05-22 02:10:06
3,Sale-9093-bfcp,Pamela Anderson,166.57,1973-12-24,21:28:34,3558512811558836,1973-Dec-24 21:28:34,1973-12-24 21:28:34
4,Sale-7567-cCLb,William Smith,857.13,2016-07-04,18:26:22,3541411469135312,2016-Jul-04 18:26:22,2016-07-04 18:26:22

### Call Center Comments Example

In [35]:
# load comments dataset
call_center_df = pd.read_json('json-files/call_center_comments.json')
print(call_center_df.describe())
print("*"*50)
print(call_center_df.info())
print("*"*50)
call_center_df.head()

                           date_time  attention_time
count                         979847   950263.000000
mean   2022-03-31 06:45:42.571045888       77.534184
min              2020-01-01 00:00:13        5.000390
25%              2021-02-14 07:39:21       41.283927
50%              2022-04-01 02:31:31       77.528448
75%       2023-05-15 11:23:50.500000      113.790497
max              2024-06-27 02:51:39      149.999955
std                              NaN       41.863647
**************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 8 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   code               1000000 non-null  object
 1   client             1000000 non-null  object
 2   product            1000000 non-null  object
 3   date_time          979847 non-null   datetime64[ns]
 4   attention_time     950263 non-null   float64
 5   comment            1000000 non-null  object
 6   country_of_origin  1000000 non-null  object
 7   city               858525 non-null   object
dtypes: datetime64[ns](1), float64(1), object(6)
memory usage: 61.0+ MB
None
**************************************************

,code,client,product,date_time,attention_time,comment,country_of_origin,city
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte
1,qDL-3585949,Craig Harris,Graphics Card,2023-10-26 10:12:43,NaN,Runs cool and quiet under load.,USA,None
2,sQo-4191674,Cody Romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan
3,QAy-6767272,Renee Sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata
4,lAI-7220154,Anthony Collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome

In [36]:
# get missing values using isnull()
call_center_df.isnull().sum()

code                      0
client                    0
product                   0
date_time             20153
attention_time        49737
comment                   0
country_of_origin         0
city                 141475
dtype: int64

In [37]:
# fill missing values using fillna()
# fill city with non-registered
call_center_filled_fd = call_center_df.copy()
call_center_filled_fd['city'] = call_center_filled_fd['city'].fillna("Non-Registered")
call_center_filled_fd.isnull().sum()

# fill attention time with average
import numpy as np
call_center_filled_fd['attention_time'] = call_center_filled_fd['attention_time'].fillna(np.nanmean(call_center_filled_fd['attention_time']))

# fill date_time with interpolation
call_center_filled_fd['date_time'] = call_center_filled_fd['date_time'].interpolate()

print(call_center_filled_fd.isnull().sum())
call_center_filled_fd.head()

code                 0
client               0
product              0
date_time            0
attention_time       0
comment              0
country_of_origin    0
city                 0
dtype: int64

,code,client,product,date_time,attention_time,comment,country_of_origin,city
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte
1,qDL-3585949,Craig Harris,Graphics Card,2023-10-26 10:12:43,77.534184,Runs cool and quiet under load.,USA,Non-Registered
2,sQo-4191674,Cody Romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan
3,QAy-6767272,Renee Sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata
4,lAI-7220154,Anthony Collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome

In [38]:
# drop missing values using dropna()
cleaned_df = call_center_df.dropna()
print(call_center_df.shape, cleaned_df.shape)
print(cleaned_df.isnull().sum())

(1000000, 8) (799390, 8)
code                 0
client               0
product              0
date_time            0
attention_time       0
comment              0
country_of_origin    0
city                 0
dtype: int64

In [39]:
# transform column using to_datetime()
call_center_df['dt_str'] = call_center_df['date_time'].astype(str)
print(call_center_df.info())
call_center_df['dt'] = pd.to_datetime(call_center_df['dt_str'])
print("*"*50)
print(call_center_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 9 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   code               1000000 non-null  object
 1   client             1000000 non-null  object
 2   product            1000000 non-null  object
 3   date_time          979847 non-null   datetime64[ns]
 4   attention_time     950263 non-null   float64
 5   comment            1000000 non-null  object
 6   country_of_origin  1000000 non-null  object
 7   city               858525 non-null   object
 8   dt_str             1000000 non-null  object
dtypes: datetime64[ns](1), float64(1), object(7)
memory usage: 68.7+ MB
None
**************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 10 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   code               1000000 non-null  object
 1   client             1000000 non-null  object
 2   product            1000000 non-null  object
 3   date_time          979847 non-null   datetime64[ns]
 4   attention_time     950263 non-null   float64
 5   comment            1000000 non-null  object
 6   country_of_origin  1000000 non-null  object
 7   city               858525 non-null   object
 8   dt_str             1000000 non-null  object
 9   dt                 979847 non-null   datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(7)
memory usage: 76.3+ MB
None

In [40]:
# transform column using to_numeric()
call_center_df['at_str'] = call_center_df['attention_time'].astype(str)
print(call_center_df.info())
call_center_df['at'] = pd.to_numeric(call_center_df['at_str'], errors='coerce')
print("*"*50)
print(call_center_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 11 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   code               1000000 non-null  object
 1   client             1000000 non-null  object
 2   product            1000000 non-null  object
 3   date_time          979847 non-null   datetime64[ns]
 4   attention_time     950263 non-null   float64
 5   comment            1000000 non-null  object
 6   country_of_origin  1000000 non-null  object
 7   city               858525 non-null   object
 8   dt_str             1000000 non-null  object
 9   dt                 979847 non-null   datetime64[ns]
 10  at_str             1000000 non-null  object
dtypes: datetime64[ns](2), float64(1), object(8)
memory usage: 83.9+ MB
None
**************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 12 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   code               1000000 non-null  object
 1   client             1000000 non-null  object
 2   product            1000000 non-null  object
 3   date_time          979847 non-null   datetime64[ns]
 4   attention_time     950263 non-null   float64
 5   comment            1000000 non-null  object
 6   country_of_origin  1000000 non-null  object
 7   city               858525 non-null   object
 8   dt_str             1000000 non-null  object
 9   dt                 979847 non-null   datetime64[ns]
 10  at_str             1000000 non-null  object
 11  at                 950263 non-null   float64
dtypes: datetime64[ns](2), float64(2), object(8)
memory usage: 91.6+ MB
None

In [41]:
# drop columns
call_center_df = call_center_df.drop(columns=['dt_str', 'at_str'], axis=1)
del call_center_df['dt']
del call_center_df['at']

call_center_df.head()

,code,client,product,date_time,attention_time,comment,country_of_origin,city
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte
1,qDL-3585949,Craig Harris,Graphics Card,2023-10-26 10:12:43,NaN,Runs cool and quiet under load.,USA,None
2,sQo-4191674,Cody Romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan
3,QAy-6767272,Renee Sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata
4,lAI-7220154,Anthony Collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome

In [42]:
# convert column to category using astype()
call_center_df = call_center_df.rename(columns={"country_of_origin": "country"})
call_center_df['country'] = call_center_df['country'].astype('category')
call_center_df['city'] = call_center_df['city'].astype('category')
print(call_center_df.info())
call_center_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 8 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   code            1000000 non-null  object
 1   client          1000000 non-null  object
 2   product         1000000 non-null  object
 3   date_time       979847 non-null   datetime64[ns]
 4   attention_time  950263 non-null   float64
 5   comment         1000000 non-null  object
 6   country         1000000 non-null  category
 7   city            858525 non-null   category
dtypes: category(2), datetime64[ns](1), float64(1), object(4)
memory usage: 47.7+ MB
None

,code,client,product,date_time,attention_time,comment,country,city
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte
1,qDL-3585949,Craig Harris,Graphics Card,2023-10-26 10:12:43,NaN,Runs cool and quiet under load.,USA,NaN
2,sQo-4191674,Cody Romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan
3,QAy-6767272,Renee Sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata
4,lAI-7220154,Anthony Collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome

### StudentsInfo for Merge and Join

In [43]:
csv_df.columns = csv_df.columns.str.lower()
print(csv_df.shape)
csv_df.head()

(30, 4)

,name,company,current position,salary (ud/year)
0,Alice Johnson,"Hernandez, Griffith and Nelson",Petroleum engineer,4740
1,David Jones,Gomez-Garcia,"Geologist, engineering",73329
2,Eva Brown,Blevins LLC,Microbiologist,83245
3,Frank Davis,Greene-Wilson,Museum education officer,74390
4,Jack Anderson,Butler PLC,"Scientist, research (maths)",69851

In [44]:
print(json_df.shape)
json_df.head()

(50, 4)

   id            name                  career                college
0   1   Alice Johnson        Computer Science        Tech University
1   2       Bob Smith  Mechanical Engineering  Engineering Institute
2   3  Carol Williams  Electrical Engineering        Tech University
3   4     David Jones                 Biology        Science College
4   5       Eva Brown                 Physics        Tech University

In [45]:
# merge dataframes using merge()
students_merge_df = pd.merge(csv_df, json_df, on='name')
students_merge_df.to_csv('csv-files/students_merge.csv', index=False)
students_merge_df.head()

,name,company,current position,salary (ud/year),id,career,college
0,Alice Johnson,"Hernandez, Griffith and Nelson",Petroleum engineer,4740,1,Computer Science,Tech University
1,David Jones,Gomez-Garcia,"Geologist, engineering",73329,4,Biology,Science College
2,Eva Brown,Blevins LLC,Microbiologist,83245,5,Physics,Tech University
3,Frank Davis,Greene-Wilson,Museum education officer,74390,6,Chemistry,Science College
4,Jack Anderson,Butler PLC,"Scientist, research (maths)",69851,10,Software Engineering,Tech University

In [46]:
# concatenate dataframes using concat()
students_concat_df = pd.concat([csv_df, json_df], axis=0)
students_concat_df.to_csv('csv-files/students_concat.csv')
print(students_concat_df.shape)
students_concat_df.head()

(80, 7)

,name,company,current position,salary (ud/year),id,career,college
0,Alice Johnson,"Hernandez, Griffith and Nelson",Petroleum engineer,4740.0,NaN,NaN,NaN
1,David Jones,Gomez-Garcia,"Geologist, engineering",73329.0,NaN,NaN,NaN
2,Eva Brown,Blevins LLC,Microbiologist,83245.0,NaN,NaN,NaN
3,Frank Davis,Greene-Wilson,Museum education officer,74390.0,NaN,NaN,NaN
4,Jack Anderson,Butler PLC,"Scientist, research (maths)",69851.0,NaN,NaN,NaN

In [47]:
#j drop duplicates
temp_concat_df = pd.concat([csv_df, csv_df.copy()], axis=0).reset_index(drop=True)
print("Concat with duplicates:", temp_concat_df.shape)
print('*'*20)
temp_concat_df = temp_concat_df.drop_duplicates()
print("Concat without duplicates:", temp_concat_df.shape)

Concat with duplicates: (60, 4)
********************
Concat without duplicates: (30, 4)

In [48]:
# join dataframes using join()
csv_df = csv_df.set_index('name')
json_df = json_df.set_index('name')
students_join_df = csv_df.join(json_df, how='inner')
print(students_join_df.shape)
students_join_df.head()

(30, 6)

,company,current position,salary (ud/year),id,career,college
name,,,,,,
Alice Johnson,"Hernandez, Griffith and Nelson",Petroleum engineer,4740,1,Computer Science,Tech University
David Jones,Gomez-Garcia,"Geologist, engineering",73329,4,Biology,Science College
Eva Brown,Blevins LLC,Microbiologist,83245,5,Physics,Tech University
Frank Davis,Greene-Wilson,Museum education officer,74390,6,Chemistry,Science College
Jack Anderson,Butler PLC,"Scientist, research (maths)",69851,10,Software Engineering,Tech University

### Again with the Call Centers

In [49]:
# group dataframes using groupby()
for country, country_df in call_center_df.groupby('country'):
    print(country)
    print(country_df, "\n")
    print("*"*50, 'Just a first example')
    break

/tmp/ipykernel_169119/1177512004.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  for country, country_df in call_center_df.groupby('country'):

Australia
               code              client            product  \
7       iQI-5637711     Richard Herrera   Wireless Charger
34      duD-2082213       Jamie Estrada    Streaming Stick
40      aLz-4866545        James Nelson     Digital Camera
58      aNx-4547164       Michael Davis            Monitor
69      wiz-4312029     Jennifer Murray         3D Printer
...             ...                 ...                ...
999927  whe-3987875        Michael Ward      Graphics Card
999944  Vrp-5289476      Jessica Barton  Bluetooth Speaker
999982  SJZ-6952659   Lawrence Bradford    Wireless Router
999990  eCs-7225095         Dave Chavez      Graphics Card
999999  XRh-5634243  Christopher Harmon    Streaming Stick

                 date_time  attention_time  \
7                      NaT       90.696875
34     2022-01-29 18:05:49       46.029668
40     2024-05-20 03:33:30      146.931571
58     2021-12-09 20:56:03       77.915983
69     2024-05-29 17:10:56       11.571618
...                    ...             ...
999927 2023-07-23 14:11:14      117.791570
999944 2023-01-15 08:12:08       62.031595
999982 2020-03-21 04:08:42       99.601211
999990 2023-06-30 09:04:15       24.288714
999999 2021-05-25 09:54:38       11.099840

                                          comment    country      city
7            Charging speed is slower than wired.  Australia    Sydney
34                  Turns any TV into a smart TV.  Australia  Canberra
40            Compact and easy to carry on trips.  Australia  Canberra
58                Stand could be more adjustable.  Australia  Adelaide
69                     Material costs can add up.  Australia     Perth
...                                           ...        ...       ...
999927            Runs cool and quiet under load.  Australia  Adelaide
999944          Great sound quality for its size.  Australia       NaN
999982                        Setup was a breeze.  Australia  Adelaide
999990  Pricey, but worth it for the performance.  Australia    Sydney
999999              Turns any TV into a smart TV.  Australia  Canberra

[66703 rows x 8 columns]

************************************************** Just a first example

In [50]:
# group by country and city
for (country, city), country_city_df in call_center_df.groupby(['country', 'city']):
    print(country, city)
    print(country_city_df)
    print("*"*20, 'Just a first example')
    break

/tmp/ipykernel_169119/2012928848.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  for (country, city), country_city_df in call_center_df.groupby(['country', 'city']):

Australia Adelaide
               code             client            product           date_time  \
58      aNx-4547164      Michael Davis            Monitor 2021-12-09 20:56:03
82      AxV-5493389         Amy Dillon      Graphics Card 2024-02-09 10:56:23
251     guI-8126215         Corey Gray             Tablet 2023-11-02 11:39:20
285     EzZ-7506837     Dylan Price MD   Wireless Charger 2021-12-28 09:58:18
481     TuI-4167846     Brittany Hardy  Bluetooth Speaker 2023-04-02 11:27:15
...             ...                ...                ...                 ...
999824  iOQ-8323119        Colleen Kim         VR Headset 2022-10-18 15:07:51
999865  ApY-4220852    Mrs. Jodi Grant                SSD 2022-10-10 01:38:48
999901  BHj-9610278   Stephanie Miller   Wireless Charger 2021-02-09 22:39:45
999927  whe-3987875       Michael Ward      Graphics Card 2023-07-23 14:11:14
999982  SJZ-6952659  Lawrence Bradford    Wireless Router 2020-03-21 04:08:42

        attention_time                                          comment  \
58           77.915983                  Stand could be more adjustable.
82          137.804867        Pricey, but worth it for the performance.
251         136.081584                  Light and easy to carry around.
285          57.067966             Charging speed is slower than wired.
481          28.677439                Great sound quality for its size.
...                ...                                              ...
999824        5.101165           Immersive gaming and media experience.
999865       22.024999  Significantly improved my computer's boot time.
999901      106.886146             Charging speed is slower than wired.
999927      117.791570                  Runs cool and quiet under load.
999982       99.601211                              Setup was a breeze.

          country      city
58      Australia  Adelaide
82      Australia  Adelaide
251     Australia  Adelaide
285     Australia  Adelaide
481     Australia  Adelaide
...           ...       ...
999824  Australia  Adelaide
999865  Australia  Adelaide
999901  Australia  Adelaide
999927  Australia  Adelaide
999982  Australia  Adelaide

[9518 rows x 8 columns]
******************** Just a first example

In [51]:
# group and aggregate dataframes using groupby() and agg()
grouped_country_df = call_center_df.groupby('country', observed=False).agg({'attention_time': ['min', 'max', 'mean', 'std']})
grouped_country_df

            attention_time
                       min         max       mean        std
country
Australia         5.002475  149.999597  77.564133  41.825168
Brazil            5.000688  149.999462  77.756712  41.852127
Canada            5.001910  149.996124  77.474514  41.881525
China             5.002371  149.999675  77.535011  41.908777
France            5.001077  149.998944  77.659527  41.936573
Germany           5.000390  149.997648  77.304183  41.765321
India             5.005280  149.995586  77.575955  41.794698
Italy             5.003875  149.996914  77.408117  41.829431
Japan             5.000739  149.999943  77.500571  41.858569
Mexico            5.000968  149.999955  77.612920  41.829822
Russia            5.000839  149.998996  77.587339  42.014596
South Korea       5.000916  149.996096  77.534233  41.851750
Spain             5.000581  149.996864  77.571777  41.893639
UK                5.002238  149.998754  77.575929  41.865870
USA               5.000887  149.996222  77.352924  41.849598

In [52]:
# group by country and city and get attention_time stats
grouped_country_city_df = call_center_df.groupby(['country', 'city'], observed=False).\
    agg({'attention_time': ['count', 'min', 'max', 'mean', 'std']})
grouped_country_city_df = grouped_country_city_df.dropna()
grouped_country_city_df.to_csv('csv-files/country_city_report.csv')
grouped_country_city_df= grouped_country_city_df.reset_index()
grouped_country_city_df

      country           city attention_time                                   \
                                      count       min         max       mean
0   Australia       Adelaide           9053  5.005949  149.983077  77.709053
1   Australia       Brisbane           9092  5.012611  149.994752  77.662205
2   Australia       Canberra           9131  5.008690  149.996272  76.959055
3   Australia      Melbourne           9084  5.026245  149.991688  77.809943
4   Australia          Perth           9025  5.023507  149.940369  77.996317
..        ...            ...            ...       ...         ...        ...
86        USA    Los Angeles           7759  5.002356  149.980056  77.425662
87        USA          Miami           7933  5.006401  149.984026  77.615529
88        USA       New York           7896  5.000887  149.976766  77.599644
89        USA  San Francisco           8028  5.019476  149.982310  77.381475
90        USA        Seattle           8001  5.006975  149.980573  77.762297


          std
0   41.633533
1   42.006778
2   41.991513
3   41.732739
4   41.843446
..        ...
86  41.674721
87  41.591648
88  42.025886
89  41.738286
90  41.958075

[91 rows x 7 columns]

In [53]:
# group and transform dataframes using groupby() and transform()
# add country avg_time and std_time to each row
call_center_df['atention_time_country_mean'] = call_center_df.groupby('country', observed=False)\
                                                ['attention_time'].transform('mean')
call_center_df['atention_time_country_std'] = call_center_df.groupby('country', observed=False)\
                                                ['attention_time'].transform('std')

call_center_df.head(10)

,code,client,product,date_time,attention_time,comment,country,city,atention_time_country_mean,atention_time_country_std
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte,77.756712,41.852127
1,qDL-3585949,Craig Harris,Graphics Card,2023-10-26 10:12:43,NaN,Runs cool and quiet under load.,USA,NaN,77.352924,41.849598
2,sQo-4191674,Cody Romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan,77.587339,42.014596
3,QAy-6767272,Renee Sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata,77.575955,41.794698
4,lAI-7220154,Anthony Collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome,77.408117,41.829431
5,fFa-1685085,Betty Aguirre,3D Printer,NaT,62.905917,Material costs can add up.,Japan,Nagoya,77.500571,41.858569
6,SxB-4119613,Timothy Rogers,USB Flash Drive,2024-01-10 13:23:40,77.976127,"Small and portable, but easy to lose.",Canada,Vancouver,77.474514,41.881525
7,iQI-5637711,Richard Herrera,Wireless Charger,NaT,90.696875,Charging speed is slower than wired.,Australia,Sydney,77.564133,41.825168
8,puR-0089354,Barbara Ayala,Streaming Stick,2021-11-28 23:25:07,35.386231,Easy to set up and use.,Japan,Tokyo,77.500571,41.858569
9,RSM-6852615,Joe Hill,External Hard Drive,2022-10-07 10:06:19,140.827411,Transfer speeds are fast and reliable.,Brazil,Belo Horizonte,77.756712,41.852127

In [54]:
# get no-repeated attention_time_country_mean
call_center_df['atention_time_country_mean'].unique()

array([77.75671188, 77.3529239 , 77.58733855, 77.57595523, 77.40811726,
       77.50057096, 77.47451364, 77.5641334 , 77.57177674, 77.30418293,
       77.5759291 , 77.65952717, 77.53423334, 77.53501086, 77.61291962])

In [55]:
# group and filter dataframes using groupby() and filter()
call_center_filtered_fd = call_center_df.groupby('country').\
                        filter(lambda x: x['attention_time'].mean() >  77.6)
print(call_center_filtered_fd['atention_time_country_mean'].unique())
call_center_filtered_fd.to_csv('csv-files/high_attention_times.csv')
call_center_filtered_fd

/tmp/ipykernel_169119/876962404.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  call_center_filtered_fd = call_center_df.groupby('country').\

[77.75671188 77.65952717 77.61291962]

,code,client,product,date_time,attention_time,comment,country,city,atention_time_country_mean,atention_time_country_std
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte,77.756712,41.852127
9,RSM-6852615,Joe Hill,External Hard Drive,2022-10-07 10:06:19,140.827411,Transfer speeds are fast and reliable.,Brazil,Belo Horizonte,77.756712,41.852127
19,viG-3123990,Michelle Taylor,USB Flash Drive,2021-06-06 23:20:09,146.901178,Write speeds could be faster.,Brazil,Rio de Janeiro,77.756712,41.852127
24,yDw-4328933,Jennifer Reid DDS,Digital Camera,2023-05-11 12:18:12,10.228264,Lenses and accessories can be expensive.,France,Toulouse,77.659527,41.936573
53,WnE-3297972,Stephanie Little MD,Wireless Charger,2022-09-19 17:16:53,104.851385,Needs precise placement to charge effectively.,Brazil,So Paulo,77.756712,41.852127
...,...,...,...,...,...,...,...,...,...,...
999958,YiC-3590203,Eric Morgan,SSD,2021-12-07 09:45:16,89.847801,Significantly improved my computer's boot time.,Brazil,Rio de Janeiro,77.756712,41.852127
999975,uZj-3207771,Jonathan Wilson,Laptop,2023-09-10 15:01:49,115.412370,Perfect for both work and gaming.,France,Toulouse,77.659527,41.936573
999981,nEq-9349515,Kayla Santiago,Smart Home Assistant,2023-08-01 05:46:29,9.912359,Concerns about privacy and data security.,Mexico,Cancun,77.612920,41.829822
999988,QcP-7760506,Tiffany Ortiz,3D Printer,2020-07-08 01:35:14,18.874672,Material costs can add up.,France,Lyon,77.659527,41.936573
999991,vpe-9551187,Tony Sims,Bluetooth Speaker,2020-07-16 01:25:28,40.999075,Water-resistant feature is a plus.,France,Paris,77.659527,41.936573

In [56]:
# pivot dataframes using pivot_table()
def create_attention_category(attention_time: float):
    if attention_time > 120:
        return 'Too Bad'
    elif attention_time > 80:
        return 'Bad'
    elif attention_time > 20:
        return 'Medium'
    else:
        return 'Acceptable'
    
call_center_df['attention_category'] = call_center_df['attention_time'].\
                    apply(lambda x: create_attention_category(x))


call_center_df.pivot_table(index='country', columns='attention_category', \
                           values='attention_time', aggfunc=['mean', 'min', 'max']).head()

/tmp/ipykernel_169119/1773039844.py:16: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  call_center_df.pivot_table(index='country', columns='attention_category', \
/tmp/ipykernel_169119/1773039844.py:16: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  call_center_df.pivot_table(index='country', columns='attention_category', \
/tmp/ipykernel_169119/1773039844.py:16: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  call_center_df.pivot_table(index='country', columns='attention_category', \

                         mean                                           min  \
attention_category Acceptable         Bad     Medium     Too Bad Acceptable
country
Australia           12.522477  100.019652  50.169422  134.997447   5.002475
Brazil              12.522218   99.969389  49.972713  134.959573   5.000688
Canada              12.595325   99.966762  50.049116  135.007696   5.001910
China               12.599466  100.056798  49.980196  135.117533   5.002371
France              12.562566  100.020798  49.870368  134.905416   5.001077

                                                            max              \
attention_category        Bad     Medium     Too Bad Acceptable         Bad
country
Australia           80.004555  20.001165  120.001180  19.998346  119.997908
Brazil              80.002097  20.002189  120.003021  19.999621  119.998658
Canada              80.004009  20.000494  120.003948  19.999028  119.999962
China               80.003693  20.000859  120.001723  19.999311  119.997419
France              80.000852  20.007444  120.005430  19.999040  119.998133


attention_category     Medium     Too Bad
country
Australia           79.998233  149.999597
Brazil              79.998772  149.999462
Canada              79.999866  149.996124
China               79.998460  149.999675
France              79.998282  149.998944

### Advanced Transformations

In [57]:
# making transformations using apply()
regions = {
    'south america': ['Brazil'],
    'north america': ['USA', 'Canada', 'Mexico'],
    'europe': ['Spain', 'France', 'UK', 'Germany', 'Italy'],
    'asia': ['China', 'South Korea', 'India', 'Japan'],
    'asia/europe': ['Russia'],
    'occeania': ['Australia']
}

def get_region(country: str) -> str:
    """
    This function returns a region based on thegiven country.

    Args:
        country(str): Country to be checked
    
    Returns:
        The region of the country.
    """
    region_result = "NA"
    for region, countries in regions.items():
        if country in countries:
            region_result = region
            break
    return region_result

# ------- Test => Feature Engineering
call_center_df['region'] = call_center_df['country'].\
                        apply(lambda c: get_region(c))
call_center_df.head()

,code,client,product,date_time,attention_time,comment,country,city,atention_time_country_mean,atention_time_country_std,attention_category,region
0,eer-4490986,Laurie Wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte,77.756712,41.852127,Bad,south america
1,qDL-3585949,Craig Harris,Graphics Card,2023-10-26 10:12:43,NaN,Runs cool and quiet under load.,USA,NaN,77.352924,41.849598,Acceptable,north america
2,sQo-4191674,Cody Romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan,77.587339,42.014596,Bad,asia/europe
3,QAy-6767272,Renee Sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata,77.575955,41.794698,Bad,asia
4,lAI-7220154,Anthony Collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome,77.408117,41.829431,Medium,europe

In [58]:
# making transformations using chain transformations
import pandas as pd
import numpy as np

call_center_original_df = pd.read_json('json-files/call_center_comments.json')
transformed_df = (
        call_center_original_df.
        assign(
            attention_time = lambda row: row['attention_time'].fillna(\
                                                    np.mean(row['attention_time'])),
            city = lambda row: row['city'].astype(str).fillna('Non-registered'),
            client = lambda row: row['client'].str.capitalize()
        ).
        dropna().
        assign(
            region = lambda row: row['country_of_origin'].apply(get_region).str.upper(),
            attention_time_mean = call_center_original_df.groupby('country_of_origin')['attention_time'].transform('mean'),
            attention_time_std = call_center_original_df.groupby('country_of_origin')['attention_time'].transform('std')
        ).
        rename(columns={'country_of_origin': 'country', 'client': 'client_name'}).
        assign(
            outlier = lambda row: (np.abs(row['attention_time'] - row['attention_time_mean'])\
                                   > row['attention_time_std']).astype(int)
        ).
        set_index('code')
    )
print(transformed_df.info())
transformed_df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 979847 entries, eer-4490986 to XRh-5634243
Data columns (total 11 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   client_name          979847 non-null  object
 1   product              979847 non-null  object
 2   date_time            979847 non-null  datetime64[ns]
 3   attention_time       979847 non-null  float64
 4   comment              979847 non-null  object
 5   country              979847 non-null  object
 6   city                 979847 non-null  object
 7   region               979847 non-null  object
 8   attention_time_mean  979847 non-null  float64
 9   attention_time_std   979847 non-null  float64
 10  outlier              979847 non-null  int64
dtypes: datetime64[ns](1), float64(3), int64(1), object(6)
memory usage: 89.7+ MB
None

,client_name,product,date_time,attention_time,comment,country,city,region,attention_time_mean,attention_time_std,outlier
code,,,,,,,,,,,
eer-4490986,Laurie wallace,SSD,2020-02-29 17:51:25,86.740331,Significantly improved my computer's boot time.,Brazil,Belo Horizonte,SOUTH AMERICA,77.756712,41.852127,0
qDL-3585949,Craig harris,Graphics Card,2023-10-26 10:12:43,77.534184,Runs cool and quiet under load.,USA,None,NORTH AMERICA,77.352924,41.849598,0
sQo-4191674,Cody romero,VR Headset,2022-08-07 02:52:48,104.754283,Immersive gaming and media experience.,Russia,Kazan,ASIA/EUROPE,77.587339,42.014596,0
QAy-6767272,Renee sanchez,Graphics Card,2020-03-21 19:23:23,86.052689,"Pricey, but worth it for the performance.",India,Kolkata,ASIA,77.575955,41.794698,0
lAI-7220154,Anthony collins,Smart Home Assistant,2021-01-08 14:00:46,35.819705,Concerns about privacy and data security.,Italy,Rome,EUROPE,77.408117,41.829431,0

### Statistical Testing

In [59]:
# making a t-test with pandas and scipy

In [60]:
# making an ANOVA test with pandas and scipy

In [61]:
# making a chi-square test with pandas and scipy

In [62]:
# making a correlation validation with pandas

In [63]:
# p-hacking example

In [64]:
# p-hacking example with multiple testing

In [65]:
# p-value example

In [66]:
# p-value correction with Bonferroni

# Generate DataSet Dummy

In [67]:
"""import json
import random
from faker import Faker

fake = Faker()

# Predefined mapping of countries to cities
countries_cities = {
    'USA': ['New York', 'Los Angeles', 'Chicago', 'San Francisco', 'Miami', 'Seattle', 'Austin', None],
    'Germany': ['Berlin', 'Munich', 'Frankfurt', 'Hamburg', 'Cologne', 'Stuttgart', None],
    'Japan': ['Tokyo', 'Osaka', 'Kyoto', 'Sapporo', 'Nagoya', 'Fukuoka', None],
    'Canada': ['Toronto', 'Vancouver', 'Montreal', 'Calgary', 'Ottawa', 'Edmonton', None],
    'UK': ['London', 'Manchester', 'Birmingham', 'Glasgow', 'Liverpool', 'Bristol', None],
    'Australia': ['Sydney', 'Melbourne', 'Brisbane', 'Perth', 'Adelaide', 'Canberra', None],
    'France': ['Paris', 'Marseille', 'Lyon', 'Toulouse', 'Nice', 'Nantes', None],
    'India': ['Mumbai', 'Delhi', 'Bangalore', 'Hyderabad', 'Chennai', 'Kolkata', None],
    'Brazil': ['So Paulo', 'Rio de Janeiro', 'Salvador', 'Braslia', 'Fortaleza', 'Belo Horizonte', None],
    'South Korea': ['Seoul', 'Busan', 'Incheon', 'Daegu', 'Daejeon', 'Gwangju', None],
    'China': ['Beijing', 'Shanghai', 'Guangzhou', 'Shenzhen', 'Chengdu', 'Xi\'an', None],
    'Russia': ['Moscow', 'Saint Petersburg', 'Novosibirsk', 'Yekaterinburg', 'Kazan', 'Nizhny Novgorod', None],
    'Italy': ['Rome', 'Milan', 'Naples', 'Turin', 'Palermo', 'Genoa', None],
    'Spain': ['Madrid', 'Barcelona', 'Valencia', 'Seville', 'Zaragoza', 'Malaga', None],
    'Mexico': ['Mexico City', 'Guadalajara', 'Monterrey', 'Puebla', 'Tijuana', 'Cancun', None]
}

# Products and sample comments
products = [
    'Laptop', 'Tablet', 'Smartphone', 'Monitor', 
    'Gaming Console', 'Smart Watch', 'E-Reader', 
    'Desktop Computer', 'Graphics Card', 'External Hard Drive', 
    'SSD', 'USB Flash Drive', 'Wireless Router', 
    'Noise Cancelling Headphones', 'Bluetooth Speaker', 
    'Smart Home Assistant', 'VR Headset', 'Drone', 
    '3D Printer', 'Digital Camera', 'Action Camera', 
    'Smart Thermostat', 'Fitness Tracker', 'Wireless Charger', 
    'Portable Projector', 'Smart Lock', 'Streaming Stick'
]

product_comments = {
    'Laptop': [
        'Incredible battery life and performance.',
        'Sleek design, but gets hot under heavy use.',
        'Perfect for both work and gaming.'
    ],
    'Tablet': [
        'Great for reading and streaming videos.',
        'Light and easy to carry around.',
        'Could use more accessories.'
    ],
    'Smartphone': [
        'Amazing camera quality, especially in low light.',
        'Battery lasts all day with moderate use.',
        'Wish it had more storage options.'
    ],
    'Monitor': [
        'Colors are vibrant and the display is sharp.',
        'Great for gaming with low latency.',
        'Stand could be more adjustable.'
    ],
    'Gaming Console': [
        'Excellent game selection and performance.',
        'Quiet operation, even during intense gameplay.',
        'Controller battery life could be better.'
    ],
    'Smart Watch': [
        'Tracks fitness activity accurately.',
        'Notifications are handy, but can be overwhelming.',
        'Battery life is good, but not great.'
    ],
    'E-Reader': [
        'Makes reading at night comfortable and easy.',
        'Battery lasts weeks on a single charge.',
        'Wish it supported more file formats natively.'
    ],
    'Desktop Computer': [
        'Powerful performance for all my computing needs.',
        'Easy to upgrade and customize.',
        'Takes up a lot of space.'
    ],
    'Graphics Card': [
        'Can handle most games at high settings.',
        'Runs cool and quiet under load.',
        'Pricey, but worth it for the performance.'
    ],
    'External Hard Drive': [
        'Compact and easy to carry.',
        'Transfer speeds are fast and reliable.',
        'Feels a bit fragile.'
    ],
    'SSD': [
        'Significantly improved my computer\'s boot time.',
        'Reliable and fast storage solution.',
        'Capacity can get expensive.'
    ],
    'USB Flash Drive': [
        'Convenient for quick file transfers.',
        'Small and portable, but easy to lose.',
        'Write speeds could be faster.'
    ],
    'Wireless Router': [
        'Strong and stable Wi-Fi coverage throughout my home.',
        'Setup was a breeze.',
        'Admin interface could be more user-friendly.'
    ],
    'Noise Cancelling Headphones': [
        'Effectively blocks out background noise.',
        'Sound quality is top-notch.',
        'Can be uncomfortable during long listening sessions.'
    ],
    'Bluetooth Speaker': [
        'Great sound quality for its size.',
        'Battery lasts all day.',
        'Water-resistant feature is a plus.'
    ],
    'Smart Home Assistant': [
        'Makes controlling smart home devices easy.',
        'Voice recognition works well.',
        'Concerns about privacy and data security.'
    ],
    'VR Headset': [
        'Immersive gaming and media experience.',
        'Setup can be complex.',
        'Requires a lot of space for the best experience.'
    ],
    'Drone': [
        'Takes amazing aerial photos and videos.',
        'Battery life limits flight time.',
        'Learning curve for beginners.'
    ],
    '3D Printer': [
        'Great for prototyping and hobby projects.',
        'Setup and calibration can be time-consuming.',
        'Material costs can add up.'
    ],
    'Digital Camera': [
        'Excellent image quality and features.',
        'Compact and easy to carry on trips.',
        'Lenses and accessories can be expensive.'
    ],
    'Action Camera': [
        'Durable and waterproof, great for adventure sports.',
        'Battery drains quickly with continuous use.',
        'Wide-angle lens captures stunning perspectives.'
    ],
    'Smart Thermostat': [
        'Easy to control from my phone.',
        'Saves on heating and cooling costs.',
        'Installation was a bit tricky.'
    ],
    'Fitness Tracker': [
        'Motivates me to stay active.',
        'Tracks a wide range of activities.',
        'Accuracy can vary depending on the activity.'
    ],
    'Wireless Charger': [
        'Convenient, just drop and charge.',
        'Charging speed is slower than wired.',
        'Needs precise placement to charge effectively.'
    ],
    'Portable Projector': [
        'Turns any room into a home theater.',
        'Battery life could be longer.',
        'Brightness is adequate for dimly lit rooms.'
    ],
    'Smart Lock': [
        'Adds convenience and security to my home.',
        'Easy to share access with family and guests.',
        'Setup was more complicated than expected.'
    ],
    'Streaming Stick': [
        'Turns any TV into a smart TV.',
        'Easy to set up and use.',
        'Sometimes lags with high-resolution content.'
    ]
}

def get_random_datetime_or_none():
    # Low probability for None
    return fake.date_time_this_decade() if random.choices([True, False], weights=[98, 2])[0] else None

def get_random_attention_time_or_none():
    # Low probability for None
    return random.uniform(5, 150) if random.choices([True, False], weights=[95, 5])[0] else None

def get_country_city():
    country = random.choice(list(countries_cities.keys()))
    city = random.choice(countries_cities[country])
    return country, city

comments = []

for i in range(1000000):
    product = random.choice(products)
    country, city = get_country_city()
    comment_text = random.choice(product_comments.get(product, ['No comment available.']))
    comment = {
        "code": fake.bothify(text='???-#######'),
        "client": fake.name(),
        "product": product,
        "date_time": get_random_datetime_or_none(),
        "attention_time": get_random_attention_time_or_none(),
        "comment": comment_text,
        "country_of_origin": country,
        "city": city
    }
    # Convert datetime to string if not None
    if comment['date_time']:
        comment['date_time'] = comment['date_time'].strftime('%Y-%m-%d %H:%M:%S')
    comments.append(comment)

# Write to JSON file
with open('csv-files/call_center_comments.json', 'w') as f:
    json.dump(comments, f, indent=4)
    """

'import json\nimport random\nfrom faker import Faker\n\nfake = Faker()\n\n# Predefined mapping of countries to cities\ncountries_cities = {\n    \'USA\': [\'New York\', \'Los Angeles\', \'Chicago\', \'San Francisco\', \'Miami\', \'Seattle\', \'Austin\', None],\n    \'Germany\': [\'Berlin\', \'Munich\', \'Frankfurt\', \'Hamburg\', \'Cologne\', \'Stuttgart\', None],\n    \'Japan\': [\'Tokyo\', \'Osaka\', \'Kyoto\', \'Sapporo\', \'Nagoya\', \'Fukuoka\', None],\n    \'Canada\': [\'Toronto\', \'Vancouver\', \'Montreal\', \'Calgary\', \'Ottawa\', \'Edmonton\', None],\n    \'UK\': [\'London\', \'Manchester\', \'Birmingham\', \'Glasgow\', \'Liverpool\', \'Bristol\', None],\n    \'Australia\': [\'Sydney\', \'Melbourne\', \'Brisbane\', \'Perth\', \'Adelaide\', \'Canberra\', None],\n    \'France\': [\'Paris\', \'Marseille\', \'Lyon\', \'Toulouse\', \'Nice\', \'Nantes\', None],\n    \'India\': [\'Mumbai\', \'Delhi\', \'Bangalore\', \'Hyderabad\', \'Chennai\', \'Kolkata\', None],\n    \'Brazil\': [\'So Paulo\', \'Rio de Janeiro\', \'Salvador\', \'Braslia\', \'Fortaleza\', \'Belo Horizonte\', None],\n    \'South Korea\': [\'Seoul\', \'Busan\', \'Incheon\', \'Daegu\', \'Daejeon\', \'Gwangju\', None],\n    \'China\': [\'Beijing\', \'Shanghai\', \'Guangzhou\', \'Shenzhen\', \'Chengdu\', \'Xi\'an\', None],\n    \'Russia\': [\'Moscow\', \'Saint Petersburg\', \'Novosibirsk\', \'Yekaterinburg\', \'Kazan\', \'Nizhny Novgorod\', None],\n    \'Italy\': [\'Rome\', \'Milan\', \'Naples\', \'Turin\', \'Palermo\', \'Genoa\', None],\n    \'Spain\': [\'Madrid\', \'Barcelona\', \'Valencia\', \'Seville\', \'Zaragoza\', \'Malaga\', None],\n    \'Mexico\': [\'Mexico City\', \'Guadalajara\', \'Monterrey\', \'Puebla\', \'Tijuana\', \'Cancun\', None]\n}\n\n# Products and sample comments\nproducts = [\n    \'Laptop\', \'Tablet\', \'Smartphone\', \'Monitor\', \n    \'Gaming Console\', \'Smart Watch\', \'E-Reader\', \n    \'Desktop Computer\', \'Graphics Card\', \'External Hard Drive\', \n    \'SSD\', \'USB Flash Drive\', \'Wireless Router\', \n    \'Noise Cancelling Headphones\', \'Bluetooth Speaker\', \n    \'Smart Home Assistant\', \'VR Headset\', \'Drone\', \n    \'3D Printer\', \'Digital Camera\', \'Action Camera\', \n    \'Smart Thermostat\', \'Fitness Tracker\', \'Wireless Charger\', \n    \'Portable Projector\', \'Smart Lock\', \'Streaming Stick\'\n]\n\nproduct_comments = {\n    \'Laptop\': [\n        \'Incredible battery life and performance.\',\n        \'Sleek design, but gets hot under heavy use.\',\n        \'Perfect for both work and gaming.\'\n    ],\n    \'Tablet\': [\n        \'Great for reading and streaming videos.\',\n        \'Light and easy to carry around.\',\n        \'Could use more accessories.\'\n    ],\n    \'Smartphone\': [\n        \'Amazing camera quality, especially in low light.\',\n        \'Battery lasts all day with moderate use.\',\n        \'Wish it had more storage options.\'\n    ],\n    \'Monitor\': [\n        \'Colors are vibrant and the display is sharp.\',\n        \'Great for gaming with low latency.\',\n        \'Stand could be more adjustable.\'\n    ],\n    \'Gaming Console\': [\n        \'Excellent game selection and performance.\',\n        \'Quiet operation, even during intense gameplay.\',\n        \'Controller battery life could be better.\'\n    ],\n    \'Smart Watch\': [\n        \'Tracks fitness activity accurately.\',\n        \'Notifications are handy, but can be overwhelming.\',\n        \'Battery life is good, but not great.\'\n    ],\n    \'E-Reader\': [\n        \'Makes reading at night comfortable and easy.\',\n        \'Battery lasts weeks on a single charge.\',\n        \'Wish it supported more file formats natively.\'\n    ],\n    \'Desktop Computer\': [\n        \'Powerful performance for all my computing needs.\',\n        \'Easy to upgrade and customize.\',\n        \'Takes up a lot of space.\'\n    ],\n    \'Graphics Card\': [\n        \'Can handle most games at high settings.\',\n        \'Runs cool and quiet under load.\',\n        \'Pricey, but worth it for the performance.\'\n    ],\n    \'External Hard Drive\': [\n        \'Compact and easy to carry.\',\n        \'Transfer speeds are fast and reliable.\',\n        \'Feels a bit fragile.\'\n    ],\n    \'SSD\': [\n        \'Significantly improved my computer\'s boot time.\',\n        \'Reliable and fast storage solution.\',\n        \'Capacity can get expensive.\'\n    ],\n    \'USB Flash Drive\': [\n        \'Convenient for quick file transfers.\',\n        \'Small and portable, but easy to lose.\',\n        \'Write speeds could be faster.\'\n    ],\n    \'Wireless Router\': [\n        \'Strong and stable Wi-Fi coverage throughout my home.\',\n        \'Setup was a breeze.\',\n        \'Admin interface could be more user-friendly.\'\n    ],\n    \'Noise Cancelling Headphones\': [\n        \'Effectively blocks out background noise.\',\n        \'Sound quality is top-notch.\',\n        \'Can be uncomfortable during long listening sessions.\'\n    ],\n    \'Bluetooth Speaker\': [\n        \'Great sound quality for its size.\',\n        \'Battery lasts all day.\',\n        \'Water-resistant feature is a plus.\'\n    ],\n    \'Smart Home Assistant\': [\n        \'Makes controlling smart home devices easy.\',\n        \'Voice recognition works well.\',\n        \'Concerns about privacy and data security.\'\n    ],\n    \'VR Headset\': [\n        \'Immersive gaming and media experience.\',\n        \'Setup can be complex.\',\n        \'Requires a lot of space for the best experience.\'\n    ],\n    \'Drone\': [\n        \'Takes amazing aerial photos and videos.\',\n        \'Battery life limits flight time.\',\n        \'Learning curve for beginners.\'\n    ],\n    \'3D Printer\': [\n        \'Great for prototyping and hobby projects.\',\n        \'Setup and calibration can be time-consuming.\',\n        \'Material costs can add up.\'\n    ],\n    \'Digital Camera\': [\n        \'Excellent image quality and features.\',\n        \'Compact and easy to carry on trips.\',\n        \'Lenses and accessories can be expensive.\'\n    ],\n    \'Action Camera\': [\n        \'Durable and waterproof, great for adventure sports.\',\n        \'Battery drains quickly with continuous use.\',\n        \'Wide-angle lens captures stunning perspectives.\'\n    ],\n    \'Smart Thermostat\': [\n        \'Easy to control from my phone.\',\n        \'Saves on heating and cooling costs.\',\n        \'Installation was a bit tricky.\'\n    ],\n    \'Fitness Tracker\': [\n        \'Motivates me to stay active.\',\n        \'Tracks a wide range of activities.\',\n        \'Accuracy can vary depending on the activity.\'\n    ],\n    \'Wireless Charger\': [\n        \'Convenient, just drop and charge.\',\n        \'Charging speed is slower than wired.\',\n        \'Needs precise placement to charge effectively.\'\n    ],\n    \'Portable Projector\': [\n        \'Turns any room into a home theater.\',\n        \'Battery life could be longer.\',\n        \'Brightness is adequate for dimly lit rooms.\'\n    ],\n    \'Smart Lock\': [\n        \'Adds convenience and security to my home.\',\n        \'Easy to share access with family and guests.\',\n        \'Setup was more complicated than expected.\'\n    ],\n    \'Streaming Stick\': [\n        \'Turns any TV into a smart TV.\',\n        \'Easy to set up and use.\',\n        \'Sometimes lags with high-resolution content.\'\n    ]\n}\n\ndef get_random_datetime_or_none():\n    # Low probability for None\n    return fake.date_time_this_decade() if random.choices([True, False], weights=[98, 2])[0] else None\n\ndef get_random_attention_time_or_none():\n    # Low probability for None\n    return random.uniform(5, 150) if random.choices([True, False], weights=[95, 5])[0] else None\n\ndef get_country_city():\n    country = random.choice(list(countries_cities.keys()))\n    city = random.choice(countries_cities[country])\n    return country, city\n\ncomments = []\n\nfor i in range(1000000):\n    product = random.choice(products)\n    country, city = get_country_city()\n    comment_text = random.choice(product_comments.get(product, [\'No comment available.\']))\n    comment = {\n        "code": fake.bothify(text=\'???-#######\'),\n        "client": fake.name(),\n        "product": product,\n        "date_time": get_random_datetime_or_none(),\n        "attention_time": get_random_attention_time_or_none(),\n        "comment": comment_text,\n        "country_of_origin": country,\n        "city": city\n    }\n    # Convert datetime to string if not None\n    if comment[\'date_time\']:\n        comment[\'date_time\'] = comment[\'date_time\'].strftime(\'%Y-%m-%d %H:%M:%S\')\n    comments.append(comment)\n\n# Write to JSON file\nwith open(\'csv-files/call_center_comments.json\', \'w\') as f:\n    json.dump(comments, f, indent=4)\n    '